
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository_ruleset.pr_ruleset["template-1-terraform"] will be created
  + resource "github_repository_ruleset" "pr_ruleset" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "protect-main-branch"
      + node_id     = (known after apply)
      + repository  = "template-1-terraform"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "main",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + required_linear_history       = true
          + required_signatures           = true
          + update                        = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }
        }
    }

  # github_repository_ruleset.pr_ruleset["template-template"] will be created
  + resource "github_repository_ruleset" "pr_ruleset" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "protect-main-branch"
      + node_id     = (known after apply)
      + repository  = "template-template"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "main",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + required_linear_history       = true
          + required_signatures           = true
          + update                        = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }
        }
    }

  # github_repository_ruleset.pr_ruleset["terraform-github"] will be created
  + resource "github_repository_ruleset" "pr_ruleset" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "protect-main-branch"
      + node_id     = (known after apply)
      + repository  = "terraform-github"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "main",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + required_linear_history       = true
          + required_signatures           = true
          + update                        = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

<!-- Sticky Pull Request Commentterraform-plan -->